class Colorpallet():
    def __init__(self, light = True):
        self.primary    = [1, 1, 0, 1]
        self.secondary  = [1, 1, 0, 1]
        self.bg         = [1, 1, 1, 1]

        self.black      = [0, 0, 0, 1]  # пользовательский цвет ВЫБРАННОГО ЭЛЕМЕНТА
        self.white      = [1, 1, 1, 1]  # пользовательский цвет ВЫБРАННОГО ЭЛЕМЕНТА
        self.darkgray   = [.3, .3, .3, 1]  # пользовательский цвет ВЫБРАННОГО ЭЛЕМЕНТА
        self.gray       = [.6, .6, .6, 1]  # пользовательский цвет ВЫБРАННОГО ЭЛЕМЕНТА
        self.lightray   = [.8, .8, .8, 1]  # пользовательский цвет ВЫБРАННОГО ЭЛЕМЕНТА

        self.navy       = [.25, .2, 1, 1]
        self.blue       = [.4, .5, .95, 1]
        self.lightblue  = [.45, .75, .9, 1]
        self.green      = [.3, .7, .2, 1]
        self.yellow     = [1, .85, .25, 1]
        self.orange     = [1, .65, .2, 1]

        self.mrestext   = [.34, .12, .12, 1]  # основной текстовый цвет
        self.unselected = [.65, .55, .35, 1]#[.7, .7, .7, 1]  # пользовательский цвет ВЫБРАННОГО ЭЛЕМЕНТА
        self.selected   = [.45, .25, .05, 1]#[.55, .25, .07, 1]  # [.87, .50, .1, 1] # пользовательский цвет ВЫБРАННОГО ЭЛЕМЕНТА
        self.hint_text  = [.8, .8, .8, 1]
        self.bg_medium = [.95, .95, .95, 1]  # пользовательский цвет ФОНА небольших элементов
        self.bg_light   = [.98, .98, .98, 1]  # пользовательский цвет ФОНА небольших элементов
        self.bg         = [.99, .99, .99, 1]